// Напишите функцию, которая принимает два числовых аргумента и возвращает наименьшее из них

// const num1 = +prompt("введите первое число");
// const num2 = +prompt("введите второе число")
// let min
// if (num1 <num2 ) {
// min=num1
// }
// else {min = num2}
// console.log(min);

// Напишите функцию, которая принимает два числовых аргумента и выводит в консоль все четные числа от большего к меньшему.

// function maxmin(number1, number2) {
//    if (number1 > number2) {
//       for (i = number1; i >number2; i--) {
//          if (i % 2 === 0) {
//             console.log(i)
//          }
//       }
//    }
//    else {
//       for (i = number2; i > number1; i--) {
//          if (i % 2 === 0) {
//             console.log(i)
//          }
//       }
//    }
// }
// maxmin(3,28)

// Напишите функцию power, которая принимает два числовых аргумента (основание степени и саму степень) и возвращает число в указанной степени. Значение степени должно быть указано по умолчанию 2.


// function power(number1,number2) {
//    const result = number1**number2
//    return result
// }
// power(10,2)

// Напишите функцию, которая принимает числовой аргумент n и считает сумму чисел от 1 до n.

// function sum(n) {
//    for (i=1; i<n;i++)
//    {  let suma = 0
//       suma=i+suma
//    }
// }
// sum(8)

// Напишите функцию, которая принимает два числовых аргумента n и m и считает сумму четных чисел и нечетных чисел от n до m. Суммы выведите в консоль (в начале сумму четных чисел, а затем сумму нечетных).

// function sumChetINechet(n,m) {
//    let sumChet = 0
//    let sumNechet = 0
//    for (let i = n; i < m; i++) {
//       if (i%2===0)
//       {sumChet = i + sumChet}
//       else  {
//       sumNechet = i + sumNechet}  
//    }
//    console.log(sumChet,sumNechet);
// }
// sumChetINechet(4,10)

// Напишите функцию, которая принимает в качестве аргументов массив строк, а возвращает первый самый длинный элемент массива. Если входной массив пуст, функция возвращает null. Если есть несколько одинаковых по длине элементов - функция возвращает первый из этих элементов. 
// Пример: [ 'one', 'two', 'three' ] => 'three'

function slova([]) {
   console.log(i);
}
slova[loj]